# WSScript_SetResReal

## Description
This function must be used inside a worksheet script called by 'RunScript' worksheet formula.<BR>
<BR>
Set the result of the worksheet script to the real value specified.

```pascal
PROCEDURE WSScript_SetResReal(resultCellValue : REAL);
```

```python
def vs.WSScript_SetResReal(resultCellValue):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|resultCellValue|REAL|The value for the result of the worksheet script called by the RunScript worksheet function.|

## Examples
```pascal
WSScript_SetResReal(1.0);
```
```python
import vs

# This function must be used inside a worksheet script called by 'RunScript'
# worksheet formula.
resultCellValue = 1.0

vs.WSScript_SetResReal(resultCellValue)
```

## See Also
VS Functions:
WSScript_GetObject
| WSScript_GetPrmInt
| WSScript_GetPrmReal
| WSScript_GetPrmStr
| WSScript_SetResStr
| WSScript_SetResReal
| WSScript_SetResImage

## Version
Availability: from Vectorworks 2016

## Category
* Worksheets